function solve(arr1, arr2){
let newArray = [];

for(let i = 0; i < arr1.length; i++){
  let curDigit1 = arr1[i];
  let curDigit2 = arr2[i];

  let sum = Number(curDigit1) + Number(curDigit2);

  if(i % 2 == 0){
    newArray.push(sum);
  } else {
    newArray.push(curDigit1 + curDigit2);
  }
}
console.log(newArray.join(' - '));
}
solve(
['5', '15', '23', '56', '35'],
['17', '22', '87', '36', '11']
);

/*Напишете функция, която получава два масива от низове и ги обединява в трети масив.
• Ако индексът на елемента е четен, добавете в третия масив сумата от двата елемента с този индекс
• Ако индексът на елемента е нечетен, добавете конкатенацията на двата елемента към този индекс

Като вход ще получите два низови масива (с еднаква дължина).

Като изход трябва да отпечатате получения трети масив, като всеки елемент е разделен с " - ".*/