function solve(arr){
let topNums = [];

for(let i = 0; i < arr.length; i++){
  let num = arr[i];
  let isTop = true; 

  for(let j = i + 1; j < arr.length; j++){
    // тук започваме от i + 1 , защото в първия цъкъл сме взели числото на 0 индекс и после искаме да проверяваме всяко следващо след него от дясната му страна.
    let rightNum = arr[j]; 

    if(rightNum >= num){
      isTop = false;
      break;
      // break , защото няма смисъл да проверяваме всички числа ако сме открили 1 , което е по голямо в дясно
    }
  }

  if(isTop){
    topNums.push(num);
  }
}

console.log(topNums.join(' '));
}
solve([1, 4, 3, 2]);

/*функция за намиране на всички top цели числа в масив. top цяло число е цяло число, което е по-голямо от всички елементи вдясно.

Отпечатайте всички top цели числа на конзолата, разделени с един интервал.*/