function solve(arr){

}
solve(["rat 10|bat 20|potion 10|rat 10|chest 100|boss 70|chest 1000"]);

/*Като млад авантюрист вие търсите злато и слава в най-тъмните подземия, които съществуват.
Имате първоначално здраве 100 и първоначални монети 0. Ще ви бъде даден низ, представляващ стаите на подземието. Всяка стая е разделена с '|' : "стая1|стая2|стая3…"
Всяка стая съдържа - предмет или чудовище; и число. Те са разделени с едно разстояние.
 
 • Ако първата част е "отвара":
o Вие сте излекувани с числото във втората част. Вашето здраве обаче не може да надвишава първоначалното ви здраве (100).
o Отпечатайте: `Вие излекувахте {healing-number} hp.`
o След това отпечатайте текущото си здраве: `Текущо здраве: {номер} к.с.`

• Ако първата част е "ракла":
o Намерихте няколко монети, числото във втората част.
o Печат: `Намерихте {coins} монети.`

• Във всеки друг случай, вие сте изправени пред чудовище, ще се биете.
Втората част на стаята съдържа атаката на чудовището, а първата - името на чудовището. Трябва да премахнете атаката на чудовището от вашето здраве.
o Ако не сте мъртъв (здраве > 0), вие сте убили чудовището и трябва да отпечатате:
„Вие убихте {monster-name}.“
o Ако сте умрели, отпечатайте: `Ти умря! Убит от {monster-name}.` и вашата мисия приключи.
Отпечатайте най-добрата стая, която можете да достигнете: „Най-добра стая: {room}“.
• Ако сте успели да преминете през всички стаи в подземието, отпечатайте на следващите три реда:
— Успяхте!
 „Монети: {coins}“
 „Здраве: {здраве}“

Получавате масив с един елемент- низ, представляващ стаите на подземието, разделени с '|' (вертикална лента): ["стая1|стая2|стая3…"].*/